In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data={'Country':['Belgium','India','Brazil'],
     'Capital':['Brussels','New Delhi','Brasilia'],
     'Population':[11190846,1303171035,207847528]}

# Series

In [3]:
s1 = pd.Series(data['Country'])

In [4]:
s1

0    Belgium
1      India
2     Brazil
dtype: object

In [5]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [6]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
s1 = pd.Series(data['Country'],index=['A','B','C'])

In [10]:
s1

A    Belgium
B      India
C     Brazil
dtype: object

In [11]:
s1.index

Index(['A', 'B', 'C'], dtype='object')

#DataFrame

#DataFrame

# DataFrame

In [12]:
df1 = pd.DataFrame(data)

In [13]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [14]:
cou = df1['Country']

In [15]:
type(cou)

pandas.core.series.Series

In [16]:
df1.iterrows()

In [17]:
for row in df1.iterrows():
    print(row),print(type(row)),print(len(row))

(0, Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object)
<class 'tuple'>
2
(1, Country            India
Capital        New Delhi
Population    1303171035
Name: 1, dtype: object)
<class 'tuple'>
2
(2, Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object)
<class 'tuple'>
2

In [18]:
for row in df1.iterrows():
    print(row[0],row[1])
    break

0 Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object

In [20]:
for row in df1.iterrows():
    print(type(row[0]),type(row[1]))
    break

<class 'int'> <class 'pandas.core.series.Series'>

In [21]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [22]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [23]:
s1 = pd.Series(data['Capital'])

In [24]:
s2 = pd.Series(data['Country'])

In [25]:
s3 = pd.Series(data['Population'])

In [26]:
df_new = pd.DataFrame([s1,s2,s3])

In [27]:
df_new

          0           1          2
0  Brussels   New Delhi   Brasilia
1   Belgium       India     Brazil
2  11190846  1303171035  207847528

In [28]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [29]:
df_new = df_new.T

In [30]:
df_new

           0        1           2
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [31]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [32]:
df_new = pd.DataFrame([s1,s2,s3], index=['Capital','Country','Population'])

In [33]:
df_new

                   0           1          2
Capital     Brussels   New Delhi   Brasilia
Country      Belgium       India     Brazil
Population  11190846  1303171035  207847528

In [35]:
df_new = df_new.T

In [36]:
df_new

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

In [37]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528